nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint16_t valueColor = isStale ? dma_display->color565(60, 60, 60) : white;

    // --- Row 1: Icon + Symbol (y=0..11) ---
    CachedIcon* icon = nullptr;
    if (strlen(tracker->icon) > 0) {
        icon = getIcon(tracker->icon);
    }
    if (icon && icon->valid) {
        // Draw icon at native 8x8 at (2, 2)
        drawIconAtScale(icon, 2, 2, 1);
    }

    // Symbol text at (13, 4) in symbolColor
    dma_display->setFont(NULL);  // Default 5x7 font
    dma_display->setTextSize(1);
    dma_display->setTextColor(symbolColor565);
    dma_display->setCursor(13, 4);
    dma_display->print(tracker->symbol);

    // --- Row 2: Price value (y=14..22) ---
    char valueBuf[20];
    formatTrackerValue(tracker->currentValue, valueBuf, sizeof(valueBuf));
    dma_display->setTextColor(valueColor);
    dma_display->setCursor(2, 16);
    dma_display->print(valueBuf);

    // Currency symbol right-aligned in TomThumb
    if (strlen(tracker->currencySymbol) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t currWidth = strlen(tracker->currencySymbol) * 4;
        dma_display->setCursor(62 - currWidth, 22);
        dma_display->print(tracker->currencySymbol);
        dma_display->setFont(NULL);  // Reset to default
    }

    // --- Row 3: Arrow + Change % (y=25..33) ---
    bool isPositive = (tracker->changePercent >= 0.0f);
    uint16_t changeColor = isPositive ? green : red;

    drawTrackerArrow(2, 27, isPositive, changeColor);

    char changeBuf[16];
    snprintf(changeBuf, sizeof(changeBuf), "%s%.2f%%",
             isPositive ? "+" : "", tracker->changePercent);
    dma_display->setTextColor(changeColor);
    dma_display->setCursor(9, 27);
    dma_display->print(changeBuf);

    // --- Separator line (y=37) ---
    drawSeparatorLine(37, dimGray);

    // --- Sparkline period label right-aligned (y=39) ---
    if (strlen(tracker->sparklinePeriod) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t periodWidth = strlen(tracker->sparklinePeriod) * 4;
        dma_display->setCursor(62 - periodWidth, 43);
        dma_display->print(tracker->sparklinePeriod);
        dma_display->setFont(NULL);
    }

    // --- Sparkline chart (y=40..53, x=2..61) ---
    if (tracker->sparklineCount >= 2) {
        drawSparkline(tracker->sparkline, tracker->sparklineCount,
                      2, 40, 60, 14, sparklineColor565);
    }

    // --- Separator line (y=55) ---
    drawSeparatorLine(55, dimGray);

    // --- Bottom text centered (y=57..63) ---
    if (strlen(tracker->bottomText) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t textWidth = strlen(tracker->bottomText) * 4;
        int16_t textX = (DISPLAY_WIDTH - textWidth) / 2;
        dma_display->setCursor(textX, 62);
        dma_display->print(tracker->bottomText);
        dma_display->setFont(NULL);
    }

    // --- Stale badge ---
    if (isStale) {
        uint16_t staleRed = dma_display->color565(200, 0, 0);
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(staleRed);
        dma_display->setCursor(42, 6);
        dma_display->print("STALE");
        dma_display->setFont(NULL);
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// Above 1.0 mm within the hour the precipitation bars switch to the saturated blue
#define TODAY_HEAVY_PRECIP_TENTHS 10

// Below this probability the hour gets no bar at all
#define TODAY_MIN_PRECIP_PROBABILITY 15

// Hourly chart geometry, all of it inside the y=32-63 block of weatherclock.
// x=61-62 belong to the page indicator, so nothing here goes past x=59.
#define TODAY_HOUR_PITCH_X      5
#define TODAY_FIRST_COLUMN_X    2
#define TODAY_BAR_WIDTH         4
#define TODAY_BAR_MAX_HEIGHT    13
#define TODAY_CHART_RIGHT_X     59
#define TODAY_EXTREMES_TOP_Y    33
#define TODAY_EXTREMES_RIGHT_X  59
#define HOURLY_PAGE_WEIGHT      2
#define TODAY_CURVE_TOP_Y       40
#define TODAY_CURVE_BOTTOM_Y    54
#define TODAY_AREA_FLOOR_Y      55
#define TODAY_BASELINE_Y        56
#define TODAY_HOUR_LABEL_TOP_Y  58
#define TODAY_HOUR_LABEL_STEP   4    // one hour label and one tick every four hours

// TomThumb has no degree sign. topY is the top row of the 3x3 diamond, which is
// the same shape after the current temperature and after the two chart extremes.
#define DEGREE_GLYPH_WIDTH 3

void drawDegreeGlyph(int16_t x, int16_t topY, uint16_t color)
{
    dma_display->drawPixel(x + 1, topY, color);
    dma_display->drawPixel(x, topY + 1, color);
    dma_display->drawPixel(x + 2, topY + 1, color);
    dma_display->drawPixel(x + 1, topY + 2, color);
}

// 3x4 lowercase h, one row shorter than a TomThumb digit so "14h" reads as a
// value with a unit rather than as three characters of equal weight.
void drawHourUnitGlyph(int16_t x, int16_t topY, uint16_t color)
{
    dma_display->drawFastVLine(x, topY + 1, 4, color);
    dma_display->drawPixel(x + 1, topY + 3, color);
    dma_display->drawPixel(x + 2, topY + 3, color);
    dma_display->drawPixel(x + 2, topY + 4, color);
}

// 7x3 mm ligature: the two m share one top bar, which is the only way to fit
// both letters in seven columns.
#define MILLIMETRE_GLYPH_WIDTH 7

void drawMillimetreGlyph(int16_t x, int16_t topY, uint16_t color)
{
    dma_display->drawFastHLine(x, topY + 2, 7, color);
    for (int16_t legX = 0; legX <= 6; legX += 2)
    {
        dma_display->drawPixel(x + legX, topY + 3, color);
        dma_display->drawPixel(x + legX, topY + 4, color);
    }
}

// The temperature ramp is anchored on absolute Celsius, not on the min and max of
// the twelve hour window. Anchored on the window, a -6 degree hour would be painted
// with the warm end of the ramp simply for being the mildest hour of a freezing day.
// Outside these two bounds the ramp saturates.
#define TODAY_RAMP_COLD_CELSIUS (-10)
#define TODAY_RAMP_WARM_CELSIUS 35

// Tenths of a degree: the ramp is sampled once per pixel column, and whole degrees
// would break a smooth gradient into five-pixel steps between two hours.
uint8_t weatherTemperatureWarmth(int16_t temperatureTenths)
{
    const int16_t coldTenths = TODAY_RAMP_COLD_CELSIUS * 10;
    const int16_t warmTenths = TODAY_RAMP_WARM_CELSIUS * 10;
    int16_t clampedTenths = constrain(temperatureTenths, coldTenths, warmTenths);
    return (uint8_t)((int32_t)(clampedTenths - coldTenths) * 255 / (warmTenths - coldTenths));
}

// Violet through pale blue and yellow green to orange, so the hue of a column
// states its temperature on its own. Two constraints shape the stops: this panel
// bleeds on saturated red, so the warm end stops at orange; and the rain bars are
// pure blues with no red at all, so every stop here keeps its red channel above
// 110 and stays a pastel, which the rain never is.
uint16_t weatherTemperatureRampColor(uint8_t warmth)
{
    // { ramp position, red, green, blue }, one stop per named temperature:
    // -10 violet, 0 periwinkle, 10 teal, 18 yellow green, 26 gold, 35 orange
    static const uint8_t rampStops[][4] = {
        {   0, 140,  70, 240 },
        {  57, 130, 130, 245 },
        { 113, 120, 205, 200 },
        { 159, 160, 225, 110 },
        { 204, 235, 205,  80 },
        { 255, 255, 140,  20 }
    };
    const uint8_t rampStopCount = sizeof(rampStops) / sizeof(rampStops[0]);

    uint8_t upperStop = rampStopCount - 1;
    for (uint8_t stop = 1; stop < rampStopCount; stop++)
    {
        if (warmth <= rampStops[stop][0])
        {
            upperStop = stop;
            break;
        }
    }
    uint8_t lowerStop = upperStop - 1;

    int16_t stopDistance = (int16_t)rampStops[upperStop][0] - (int16_t)rampStops[lowerStop][0];
    int16_t positionInStop = (int16_t)warmth - (int16_t)rampStops[lowerStop][0];

