nicolas-codemate/esp32-pixelcast/src/main.cpp
    char minLabel[8];
    snprintf(minLabel, sizeof(minLabel), "%d", temperatureMin);
    uint16_t minColor = weatherTemperatureRampColor(weatherTemperatureWarmth(temperatureMin * 10));
    int16_t minDegreeX = TODAY_EXTREMES_RIGHT_X - 2;
    dma_display->setTextColor(minColor);
    dma_display->setCursor(minDegreeX - calculateTomThumbTextWidth(minLabel), TODAY_EXTREMES_TOP_Y + 5);
    dma_display->print(minLabel);
    drawDegreeGlyph(minDegreeX, TODAY_EXTREMES_TOP_Y, minColor);
    dma_display->setFont(NULL);

    // ---- Curve, filled pass (y=40-55) ----
    const int16_t curveHeight = TODAY_CURVE_BOTTOM_Y - TODAY_CURVE_TOP_Y;
    int16_t temperatureRange = temperatureMax - temperatureMin;

    int16_t pointY[MAX_TODAY_HOURS];
    for (uint8_t i = 0; i < today->hourCount; i++)
    {
        if (temperatureRange == 0)
        {
            pointY[i] = (TODAY_CURVE_TOP_Y + TODAY_CURVE_BOTTOM_Y) / 2;
        }
        else
        {
            // The row is rounded as a whole rather than the offset alone, so a
            // half-row tie lands one row lower, like the reference render
            int32_t scaledRow = (int32_t)TODAY_CURVE_BOTTOM_Y * 2 * temperatureRange +
                                temperatureRange -
                                2 * (int32_t)(today->hours[i].temp - temperatureMin) * curveHeight;
            pointY[i] = (int16_t)(scaledRow / (2 * temperatureRange));
        }
    }

    // A window shorter than twelve hours keeps the same pitch and stops where its
    // data stops, rather than extending the last hour across the empty half
    int16_t lastColumnX = min((int16_t)TODAY_CHART_RIGHT_X,
                              (int16_t)(todayColumnCenterX(today->hourCount - 1) + 2));
    displayDrawTodayCurve(today, pointY, lastColumnX, true);

    // ---- Rain bars (y=43-55) ----
    uint8_t barHeight[MAX_TODAY_HOURS];
    for (uint8_t i = 0; i < today->hourCount; i++)
    {
        uint8_t probability = today->hours[i].precipProbability;
        if (probability < TODAY_MIN_PRECIP_PROBABILITY)
        {
            barHeight[i] = 0;
            continue;
        }
        barHeight[i] = (uint8_t)max(1, (probability * TODAY_BAR_MAX_HEIGHT + 50) / 100);

        uint16_t barColor = (today->hours[i].precipTenthsOfMm >= TODAY_HEAVY_PRECIP_TENTHS)
            ? heavyRainBlue
            : lightRainBlue;
        dma_display->fillRect(todayColumnCenterX(i) - TODAY_BAR_WIDTH / 2,
                              TODAY_BASELINE_Y - barHeight[i],
                              TODAY_BAR_WIDTH, barHeight[i], barColor);
    }

    // ---- Curve, bare pass over the bars ----
    displayDrawTodayCurve(today, pointY, lastColumnX, false);

    // ---- Axis (y=56) and hour labels (y=58-62) ----
    dma_display->drawFastHLine(0, TODAY_BASELINE_Y, TODAY_CHART_RIGHT_X + 1, axisGray);
    for (uint8_t i = 0; i < today->hourCount; i += TODAY_HOUR_LABEL_STEP)
    {
        dma_display->drawPixel(todayColumnCenterX(i), TODAY_BASELINE_Y, labelGray);

        char hourLabel[4];
        snprintf(hourLabel, sizeof(hourLabel), "%d", today->hours[i].hour);
        int16_t hourNumberWidth = calculateTomThumbTextWidth(hourLabel);
        int16_t hourLabelX = max(0, todayColumnCenterX(i) - (hourNumberWidth + 4) / 2);

        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(labelGray);
        dma_display->setCursor(hourLabelX, TODAY_HOUR_LABEL_TOP_Y + 5);
        dma_display->print(hourLabel);
        dma_display->setFont(NULL);
        drawHourUnitGlyph(hourLabelX + hourNumberWidth + 1, TODAY_HOUR_LABEL_TOP_Y, labelGray);
    }

    displayDrawTodayRainTotal(today);
}

void displayShowWeatherClock(uint16_t appDuration) {
    // Fallback to time display if weather data is stale or missing
    unsigned long weatherAge = millis() - weatherData.lastUpdate;
    if (!weatherData.valid || weatherAge > 3600000) {
        displayShowTime();
        return;
    }

    // Use global weatherLastDrawnMinute / weatherLastUpdateDrawn
    // (reset by displayShowApp on app switch to force full redraw)

    time_t nowUtc = time(nullptr);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    int hours = localTm.tm_hour;
    int minutes = localTm.tm_min;
    int seconds = localTm.tm_sec;

    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    bool needsFullRedraw = (weatherLastDrawnMinute != minutes) ||
                           (weatherLastUpdateDrawn != weatherData.lastUpdate);

    // Forecast pagination. The hourly window, when there is one, takes the first
    // page of the same carousel and pushes the days one page to the right.
    bool hasHourlyPage = (weatherData.today.hourCount > 0);
    uint8_t dayPageCount =
        (weatherData.forecastCount + FORECAST_COLUMNS - 1) / FORECAST_COLUMNS;
    uint8_t forecastPageCount = max((uint8_t)1, (uint8_t)(dayPageCount + (hasHourlyPage ? 1 : 0)));

    // The hourly page carries a chart to read, not three columns to glance at, so it
    // holds the screen HOURLY_PAGE_WEIGHT times longer than a day page. The app's
    // total time is unchanged: the day pages give up what the chart takes.
    uint8_t totalPageWeight = forecastPageCount + (hasHourlyPage ? HOURLY_PAGE_WEIGHT - 1 : 0);
    unsigned long dayPageInterval = (unsigned long)appDuration / totalPageWeight;

    // A payload with fewer days, or with the hourly window dropped, can leave the
    // carousel parked on a page that no longer exists
    if (forecastPage >= forecastPageCount) {
        forecastPage = 0;
    }

    bool isHourlyPage = (hasHourlyPage && forecastPage == 0);
    unsigned long pageInterval = isHourlyPage ? dayPageInterval * HOURLY_PAGE_WEIGHT : dayPageInterval;

    bool pageChanged = false;
    if (forecastPageCount > 1) {
        unsigned long now = millis();
        if (now - lastForecastPageSwitch >= pageInterval) {
            forecastPage = (forecastPage + 1) % forecastPageCount;
            lastForecastPageSwitch = now;
            pageChanged = true;
        }
    }

    bool needsForecastRedraw = needsFullRedraw || pageChanged;

