nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t cyan = dma_display->color565(0, 180, 255);
    uint16_t mintGreen = dma_display->color565(100, 255, 180);
    uint16_t gray = dma_display->color565(140, 140, 140);
    uint16_t coral = dma_display->color565(255, 140, 100);
    uint16_t coldBlue = dma_display->color565(80, 140, 255);
    uint16_t warmRed = dma_display->color565(255, 50, 30);
    uint16_t black = dma_display->color565(0, 0, 0);

    // ============================================================
    // Layout map (64x64 display)
    // NULL font: setCursor = top-left of glyph, char is 7px tall
    // TomThumb: setCursor = baseline, uppercase chars 5px above baseline
    // ============================================================
    // y=0-8:    current weather (icon 8x8 + temp + min/max)
    // y=10:     separator
    // y=13-19:  HH:MM (NULL font top=13) + :SS (TomThumb baseline=20)
    // y=22-28:  date (NULL font top=22)
    // y=31:     separator
    // y=32-63:  carousel (32px) - hourly chart first when the data is there,
    //           then the forecast days FORECAST_COLUMNS at a time
    //   y=39:     day names (TomThumb baseline=39)
    //   y=41-48:  forecast icons (8x8)
    //   y=56:     min temps (TomThumb baseline=56)
    //   y=63:     max temps (TomThumb baseline=63)
    // ============================================================

    if (needsFullRedraw) {
        // Clear and redraw each section individually to avoid full-screen flicker

        // ---- Current weather (y=0-10) ----
        dma_display->fillRect(0, 0, DISPLAY_WIDTH, 11, black);
        int16_t weatherTextX = 2;
        const uint16_t* builtinCurrentIcon = getBuiltinWeatherIcon(weatherData.currentIcon);
        if (builtinCurrentIcon) {
            drawProgmemIcon(dma_display, builtinCurrentIcon, 1, 1, 1);
            weatherTextX = 11;
        } else {
            CachedIcon* currentIcon = getIcon(weatherData.currentIcon);
            if (currentIcon && currentIcon->valid) {
                drawIconAtScale(currentIcon, 1, 1, 1);
                weatherTextX = 11;
            }
        }

        // Temperature (NULL font, top at y=2 to align with icon)
        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(white);

        // Today's min/max on the right, each followed by the same degree diamond as
        // the current temperature. Positions are chained from the measured widths so
        // a one- or three-digit value keeps its diamond attached.
        char todayMinStr[8], todayMaxStr[8];
        snprintf(todayMinStr, sizeof(todayMinStr), "%d", weatherData.currentTempMin);
        snprintf(todayMaxStr, sizeof(todayMaxStr), "%d", weatherData.currentTempMax);

        const int16_t degreeAdvance = DEGREE_GLYPH_WIDTH + 1;
        int16_t minAdvance = calculateTomThumbTextWidth(todayMinStr);
        int16_t maxAdvance = calculateTomThumbTextWidth(todayMaxStr);
        int16_t slashAdvance = calculateTomThumbTextWidth("/");
        int16_t pairWidth = minAdvance + degreeAdvance + slashAdvance + maxAdvance + DEGREE_GLYPH_WIDTH;
        int16_t minX = DISPLAY_WIDTH - 2 - pairWidth;

        char tempStr[8];
        snprintf(tempStr, sizeof(tempStr), "%d", weatherData.currentTemp);
        dma_display->setCursor(weatherTextX, 2);
        dma_display->print(tempStr);

        // Sub-zero on all three values would run the current temperature into the
        // pair, and the diamond is the first thing worth giving up
        int16_t degreeX = weatherTextX + strlen(tempStr) * 6;
        if (degreeX + DEGREE_GLYPH_WIDTH <= minX) {
            drawDegreeGlyph(degreeX, 1, white);
        }

        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(coldBlue);
        dma_display->setCursor(minX, 8);
        dma_display->print(todayMinStr);
        drawDegreeGlyph(minX + minAdvance, 3, coldBlue);

        int16_t slashX = minX + minAdvance + degreeAdvance;
        dma_display->setTextColor(gray);
        dma_display->setCursor(slashX, 8);
        dma_display->print("/");

        int16_t maxX = slashX + slashAdvance;
        dma_display->setTextColor(warmRed);
        dma_display->setCursor(maxX, 8);
        dma_display->print(todayMaxStr);
        drawDegreeGlyph(maxX + maxAdvance, 3, warmRed);

        // ---- Separator (y=10) ----
        dma_display->fillRect(0, 10, DISPLAY_WIDTH, 1, black);
        drawSeparatorLine(10, dimGray);

        // ---- Date (y=21-30) ----
        dma_display->fillRect(0, 21, DISPLAY_WIDTH, 10, black);

        static const char* monthNamesFr[] = {"JAN", "FEV", "MAR", "AVR", "MAI", "JUN",
                                             "JUL", "AOU", "SEP", "OCT", "NOV", "DEC"};

        char dateStr[16];
        snprintf(dateStr, sizeof(dateStr), "%s %02d %s",
                 dayNamesFr[localTm.tm_wday],
                 localTm.tm_mday,
                 monthNamesFr[localTm.tm_mon]);

        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(gray);

        int16_t dateWidth = strlen(dateStr) * 6;
        int16_t dateX = (DISPLAY_WIDTH - dateWidth) / 2;
        dma_display->setCursor(dateX, 22);
        dma_display->print(dateStr);

        // ---- Separator (y=31) ----
        drawSeparatorLine(31, dimGray);

        weatherLastDrawnMinute = minutes;
        weatherLastUpdateDrawn = weatherData.lastUpdate;
    }

    // ---- Forecast (y=33-63) - redrawn on full redraw or page change ----
    if (needsForecastRedraw) {
        dma_display->fillRect(0, 32, DISPLAY_WIDTH, 32, black);

        if (hasHourlyPage && forecastPage == 0) {
            displayShowTodayChart(&weatherData.today);
        } else {
            // Compute which forecast days to display on the current page
            uint8_t dayPage = hasHourlyPage ? (forecastPage - 1) : forecastPage;
            uint8_t pageStart = dayPage * FORECAST_COLUMNS;
            uint8_t displayCount = min((uint8_t)FORECAST_COLUMNS,
                (uint8_t)(weatherData.forecastCount - pageStart));

            for (int col = 0; col < displayCount; col++) {
                int forecastIndex = pageStart + col;

                // Dynamic centering based on number of columns on this page
                int16_t colCenter;
                if (displayCount == 1) {
                    colCenter = 32;
                } else if (displayCount == 2) {
                    colCenter = 16 + col * 32;
                } else {
                    colCenter = 11 + col * 21;
                }

                // Day name (TomThumb baseline=39, glyphs y=34-38)
                dma_display->setFont(&TomThumb);
                dma_display->setTextColor(coral);
                int16_t dayNameWidth = strlen(weatherData.forecast[forecastIndex].dayName) * 4;
                dma_display->setCursor(colCenter - dayNameWidth / 2, 39);
                dma_display->print(weatherData.forecast[forecastIndex].dayName);

                // Forecast icon (8x8 native, y=41-48)
                const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[forecastIndex].icon);
                if (builtinForecastIcon) {
                    drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 41, 1);
                } else {
                    CachedIcon* forecastIcon = getIcon(weatherData.forecast[forecastIndex].icon);
                    if (forecastIcon && forecastIcon->valid) {
                        drawIconAtScale(forecastIcon, colCenter - 4, 41, 1);
                    }
                }

                // Min temp in blue (TomThumb baseline=56, glyphs y=51-55)
                char minStr[8];
                snprintf(minStr, sizeof(minStr), "%d", weatherData.forecast[forecastIndex].tempMin);
                dma_display->setFont(&TomThumb);
                dma_display->setTextColor(coldBlue);
                int16_t minAdvance = calculateTomThumbTextWidth(minStr);
                int16_t minX = colCenter - (minAdvance + DEGREE_GLYPH_WIDTH) / 2;
                dma_display->setCursor(minX, 56);
                dma_display->print(minStr);
                drawDegreeGlyph(minX + minAdvance, 51, coldBlue);

