nicolas-codemate/esp32-pixelcast/src/main.cpp
    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// ============================================================================
// Indicator Functions
// ============================================================================

void indicatorInit() {
    memset(indicators, 0, sizeof(indicators));
    memset(indicatorAnimState, 0, sizeof(indicatorAnimState));

    // Default colors: red, green, blue
    indicators[0].color = 0xFF0000;
    indicators[1].color = 0x00FF00;
    indicators[2].color = 0x0000FF;

    for (uint8_t i = 0; i < NUM_INDICATORS; i++) {
        indicators[i].blinkInterval = INDICATOR_BLINK_INTERVAL;
        indicators[i].fadePeriod = INDICATOR_FADE_PERIOD;
    }
}

void indicatorSet(uint8_t index, IndicatorMode mode, uint32_t color,
                  uint16_t blinkInterval, uint16_t fadePeriod) {
    if (index >= NUM_INDICATORS) return;

    indicators[index].mode = mode;
    indicators[index].color = color;
    indicators[index].blinkInterval = blinkInterval > 0 ? blinkInterval : INDICATOR_BLINK_INTERVAL;
    indicators[index].fadePeriod = fadePeriod > 0 ? fadePeriod : INDICATOR_FADE_PERIOD;

    // Reset animation state
    indicatorAnimState[index].lastToggle = millis();
    indicatorAnimState[index].blinkOn = true;
    indicatorAnimState[index].cycleStart = millis();
}

void indicatorOff(uint8_t index) {
    if (index >= NUM_INDICATORS) return;
    indicators[index].mode = INDICATOR_OFF;
}

bool indicatorNeedsRedraw() {
    for (uint8_t i = 0; i < NUM_INDICATORS; i++) {
        if (indicators[i].mode == INDICATOR_BLINK || indicators[i].mode == INDICATOR_FADE) {
            return true;
        }
    }
    return false;
}

void drawIndicators() {
    unsigned long now = millis();

    for (uint8_t i = 0; i < NUM_INDICATORS; i++) {
        if (indicators[i].mode == INDICATOR_OFF) continue;

        // Compute corner position
        int16_t x, y;
        switch (i) {
            case 0: x = 0; y = 0; break;                                             // Top-left
            case 1: x = DISPLAY_WIDTH - INDICATOR_FOOTPRINT; y = 0; break;           // Top-right
            case 2: x = DISPLAY_WIDTH - INDICATOR_FOOTPRINT;                          // Bottom-right
                    y = DISPLAY_HEIGHT - INDICATOR_FOOTPRINT; break;
            default: continue;
        }

        // Extract base color
        uint8_t r = (indicators[i].color >> 16) & 0xFF;
        uint8_t g = (indicators[i].color >> 8) & 0xFF;
        uint8_t b = indicators[i].color & 0xFF;

        // Apply mode effect
        switch (indicators[i].mode) {
            case INDICATOR_SOLID:
                // Full brightness, no change
                break;

            case INDICATOR_BLINK: {
                if (now - indicatorAnimState[i].lastToggle >= indicators[i].blinkInterval) {
                    indicatorAnimState[i].blinkOn = !indicatorAnimState[i].blinkOn;
                    indicatorAnimState[i].lastToggle = now;
                }
                if (!indicatorAnimState[i].blinkOn) continue;  // Skip drawing when off
                break;
            }

            case INDICATOR_FADE: {
                // Triangle wave: ramp up then ramp down, min brightness 10/255
                unsigned long elapsed = (now - indicatorAnimState[i].cycleStart) % indicators[i].fadePeriod;
                uint16_t halfPeriod = indicators[i].fadePeriod / 2;
                uint8_t brightness;
                if (elapsed < halfPeriod) {
                    brightness = 10 + (uint16_t)(245 * elapsed) / halfPeriod;
                } else {
                    brightness = 10 + (uint16_t)(245 * (indicators[i].fadePeriod - elapsed)) / halfPeriod;
                }
                r = (uint16_t)r * brightness / 255;
                g = (uint16_t)g * brightness / 255;
                b = (uint16_t)b * brightness / 255;
                break;
            }

            default:
                continue;
        }

        // Draw black border (full footprint)
        dma_display->fillRect(x, y, INDICATOR_FOOTPRINT, INDICATOR_FOOTPRINT,
                              dma_display->color565(0, 0, 0));

        // Draw colored core (inset by border size)
        dma_display->fillRect(x + INDICATOR_BORDER_SIZE, y + INDICATOR_BORDER_SIZE,
                              INDICATOR_CORE_SIZE, INDICATOR_CORE_SIZE,
                              dma_display->color565(r, g, b));
    }
}

void handleIndicatorApi(AsyncWebServerRequest *request, JsonVariant &json, uint8_t index) {
    if (index >= NUM_INDICATORS) {
        request->send(400, "application/json", "{\"error\":\"Invalid indicator index\"}");
        return;
    }

    JsonObject body = json.as<JsonObject>();

    // Parse mode string
    const char* modeStr = body["mode"] | "";
    IndicatorMode mode = INDICATOR_OFF;

    if (strlen(modeStr) > 0) {
        if (strcmp(modeStr, "solid") == 0) mode = INDICATOR_SOLID;
        else if (strcmp(modeStr, "blink") == 0) mode = INDICATOR_BLINK;
        else if (strcmp(modeStr, "fade") == 0) mode = INDICATOR_FADE;
        else if (strcmp(modeStr, "off") == 0) mode = INDICATOR_OFF;
        else {
            request->send(400, "application/json", "{\"error\":\"Invalid mode. Use: off, solid, blink, fade\"}");
            return;
        }
    } else if (!body["color"].isNull()) {
        // Default to solid if color provided but no mode
        mode = INDICATOR_SOLID;
    }

    if (mode == INDICATOR_OFF) {
        indicatorOff(index);
        saveSettings();
        Serial.printf("[API] Indicator %d turned off\n", index + 1);
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
        return;
    }

    // Parse color (reuse parseColorValue helper)
    uint32_t color = parseColorValue(body["color"], indicators[index].color);

    // Parse optional timing parameters
    uint16_t blinkInterval = body["blinkInterval"] | (uint16_t)INDICATOR_BLINK_INTERVAL;
    uint16_t fadePeriod = body["fadePeriod"] | (uint16_t)INDICATOR_FADE_PERIOD;

    indicatorSet(index, mode, color, blinkInterval, fadePeriod);
    saveSettings();

