nicolas-codemate/esp32-pixelcast/src/main.cpp
        unsigned long ageMs = millis() - tracker->lastUpdate;
        doc["age"] = ageMs / 1000;
        doc["stale"] = (ageMs > TRACKER_STALE_TIMEOUT);

        if (tracker->sparklineCount > 0) {
            JsonArray sparkArr = doc["sparkline"].to<JsonArray>();
            for (uint8_t i = 0; i < tracker->sparklineCount; i++) {
                sparkArr.add(tracker->sparkline[i]);
            }
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // DELETE /api/tracker?name=btc - Remove tracker
    webServer.on("/api/tracker", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        if (trackerRemove(name.c_str())) {
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"Tracker not found\"}");
        }
    });

    // POST /api/tracker?name=btc - Create/update tracker
    AsyncCallbackJsonWebHandler* trackerHandler = new AsyncCallbackJsonWebHandler("/api/tracker",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /tracker handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Get tracker name from query param or JSON
            String name;
            if (request->hasParam("name")) {
                name = request->getParam("name")->value();
            } else if (!doc["name"].isNull()) {
                name = doc["name"].as<String>();
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
                return;
            }

            // Allocate or find existing tracker
            TrackerData* tracker = trackerAllocate(name.c_str());
            if (!tracker) {
                request->send(500, "application/json", "{\"error\":\"No tracker slot available\"}");
                return;
            }

            // Parse fields
            if (!doc["symbol"].isNull()) {
                strlcpy(tracker->symbol, doc["symbol"] | "", sizeof(tracker->symbol));
            }
            if (!doc["icon"].isNull()) {
                strlcpy(tracker->icon, doc["icon"] | "", sizeof(tracker->icon));
            }
            if (!doc["currency"].isNull()) {
                strlcpy(tracker->currencySymbol, doc["currency"] | "", sizeof(tracker->currencySymbol));
            }
            if (!doc["value"].isNull()) {
                tracker->currentValue = doc["value"].as<float>();
            }
            if (!doc["change"].isNull()) {
                tracker->changePercent = doc["change"].as<float>();
            }
            if (!doc["bottomText"].isNull()) {
                strlcpy(tracker->bottomText, doc["bottomText"] | "", sizeof(tracker->bottomText));
            }
            if (!doc["sparklinePeriod"].isNull()) {
                strlcpy(tracker->sparklinePeriod, doc["sparklinePeriod"] | "", sizeof(tracker->sparklinePeriod));
            }

            tracker->symbolColor = parseColorValue(doc["symbolColor"], tracker->symbolColor);
            tracker->sparklineColor = parseColorValue(doc["sparklineColor"], tracker->sparklineColor);

            // Parse sparkline data (float array -> scaled uint16)
            if (doc["sparkline"].is<JsonArray>()) {
                JsonArray sparkArr = doc["sparkline"];
                uint8_t count = min((int)sparkArr.size(), (int)MAX_SPARKLINE_POINTS);

                if (count >= 2) {
                    // Find min/max of float values
                    float minVal = sparkArr[0].as<float>();
                    float maxVal = minVal;
                    for (uint8_t i = 1; i < count; i++) {
                        float v = sparkArr[i].as<float>();
                        if (v < minVal) minVal = v;
                        if (v > maxVal) maxVal = v;
                    }

                    float range = maxVal - minVal;
                    if (range < 0.0001f) range = 1.0f;

                    // Scale to uint16 (0-65535)
                    for (uint8_t i = 0; i < count; i++) {
                        float normalized = (sparkArr[i].as<float>() - minVal) / range;
                        tracker->sparkline[i] = (uint16_t)(normalized * 65535.0f);
                    }
                    tracker->sparklineCount = count;
                }
            }

            tracker->lastUpdate = millis();

            // Register/update app in rotation
            char appId[32];
            snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name.c_str());
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_APP_DURATION;
            appAdd(appId, tracker->symbol, tracker->icon, 0xFFFFFF,
                   duration, 0, 0, false);

            Serial.printf("[TRACKER] Updated: %s (%s = %.2f)\n",
                         name.c_str(), tracker->symbol, tracker->currentValue);
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(trackerHandler);

    // ========================================================================
    // Sleep API
    // ========================================================================

    webServer.on("/api/sleep", HTTP_GET, [](AsyncWebServerRequest *request)
    {
        Serial.println("[API] /sleep GET");

        JsonDocument doc;
        bool active = sleepIsActive();
        doc["sleeping"] = active;
        if (active)
        {
            doc["reason"] = sleepReasonToString(lastSleepReason);
            if (lastSleepReason == SLEEP_REASON_OVERRIDE)
            {
                doc["until"] = settings.sleep.sleepUntilEpoch;
            }
        }
        else if (lastSleepReason == SLEEP_REASON_NTP_NOT_SYNCED)
        {
            doc["reason"] = sleepReasonToString(lastSleepReason);
        }
        buildSleepConfigJson(doc["config"].to<JsonObject>());

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

