nicolas-codemate/esp32-pixelcast/src/main.cpp
    AsyncCallbackJsonWebHandler *sleepHandler = new AsyncCallbackJsonWebHandler(
        "/api/sleep",
        [](AsyncWebServerRequest *request, JsonVariant &json)
        {
            Serial.println("[API] /sleep POST");

            JsonObject body = json.as<JsonObject>();
            if (body.isNull())
            {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            String errorMessage;
            if (!applySleepUpdate(body, errorMessage))
            {
                JsonDocument errorDoc;
                errorDoc["error"] = errorMessage;
                String output;
                serializeJson(errorDoc, output);
                request->send(400, "application/json", output);
                return;
            }
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(sleepHandler);

    webServer.on("/api/sleep/wake", HTTP_POST, [](AsyncWebServerRequest *request)
    {
        Serial.println("[API] /sleep/wake POST");
        wakeNow();
        request->send(200, "application/json", "{\"success\":true}");
    });

    // ========================================================================
    // Notification API
    // ========================================================================

    // POST /api/notify/dismiss - Dismiss current notification
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/dismiss", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (notifDismiss()) {
            resetNotifScrollState();
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"No active notification\"}");
        }
    });

    // GET /api/notify/list - List all active notifications
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/list", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        doc["count"] = notificationCount;
        doc["currentIndex"] = currentNotifIndex;

        JsonArray arr = doc["notifications"].to<JsonArray>();
        for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
            if (!notifications[i].active) continue;
            JsonObject obj = arr.add<JsonObject>();
            obj["id"] = notifications[i].id;
            obj["text"] = notifications[i].text;
            obj["icon"] = notifications[i].icon;
            obj["duration"] = notifications[i].duration;
            obj["hold"] = notifications[i].hold;
            obj["urgent"] = notifications[i].urgent;
            obj["stack"] = notifications[i].stack;
            obj["displayed"] = notifications[i].displayedAt > 0;
            obj["current"] = (i == (uint8_t)currentNotifIndex);
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // POST /api/notify - Send a notification
    AsyncCallbackJsonWebHandler* notifyHandler = new AsyncCallbackJsonWebHandler("/api/notify",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /notify handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Text is required
            if (doc["text"].isNull() || strlen(doc["text"] | "") == 0) {
                request->send(400, "application/json", "{\"error\":\"Missing text\"}");
                return;
            }

            const char* text = doc["text"] | "";
            const char* id = doc["id"] | "";
            const char* icon = doc["icon"] | "";
            uint32_t textColor = parseColorValue(doc["color"], 0xFFFFFF);
            uint32_t bgColor = parseColorValue(doc["background"], 0x000000);
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_NOTIF_DURATION;
            bool hold = doc["hold"] | false;
            bool urgent = doc["urgent"] | false;
            bool stack = doc["stack"] | true;

            int8_t slot = notifAdd(id, text, icon, textColor, bgColor,
                                   duration, hold, urgent, stack);

            if (slot < 0) {
                request->send(503, "application/json", "{\"error\":\"Notification queue full\"}");
                return;
            }

            // Return the assigned ID
            char response[128];
            snprintf(response, sizeof(response),
                     "{\"success\":true,\"id\":\"%s\"}", notifications[slot].id);
            request->send(200, "application/json", response);
        });
    webServer.addHandler(notifyHandler);

    // DELETE /api/indicator{1-3} - Turn off indicator
    webServer.on("/api/indicator1", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(0); saveSettings();
        Serial.println("[API] Indicator 1 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });
    webServer.on("/api/indicator2", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(1); saveSettings();
        Serial.println("[API] Indicator 2 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });
    webServer.on("/api/indicator3", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(2); saveSettings();
        Serial.println("[API] Indicator 3 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });

    // POST /api/indicator{1-3} - Set corner indicators
    for (uint8_t idx = 0; idx < NUM_INDICATORS; idx++) {
        String path = "/api/indicator" + String(idx + 1);
        AsyncCallbackJsonWebHandler* indicatorHandler = new AsyncCallbackJsonWebHandler(
            path.c_str(),
            [idx](AsyncWebServerRequest *request, JsonVariant &json) {
                handleIndicatorApi(request, json, idx);
            });
        indicatorHandler->setMethod(HTTP_POST);
        webServer.addHandler(indicatorHandler);
    }
    Serial.println("[WEB] Indicator API endpoints registered");

    // POST /api/reboot - Reboot device (deferred to allow response to be sent)
    webServer.on("/api/reboot", HTTP_POST, [](AsyncWebServerRequest *request) {
        Serial.println("[API] Reboot requested");
        request->send(200, "application/json", "{\"success\":true,\"message\":\"Rebooting...\"}");
        pendingReboot = true;
        rebootRequestTime = millis();
    });

    // ========================================================================
    // Icon Management API
    // ========================================================================

    // GET /icons.html - Web interface for icon management
    webServer.on("/icons.html", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/html", ICONS_HTML);
    });

    // GET /api/icons/{name} - Serve icon file (must be before /api/icons to avoid prefix match)
    webServer.on("^\\/api\\/icons\\/([a-zA-Z0-9_-]+)$", HTTP_GET, [](AsyncWebServerRequest *request) {
        String iconName = request->pathArg(0);
        handleApiIconsServe(request, iconName);
    });

    // GET /api/icons - List all icons
    webServer.on("/api/icons", HTTP_GET, handleApiIconsList);

    // DELETE /api/icons?name={name} - Delete an icon
    webServer.on("/api/icons", HTTP_DELETE, handleApiIconsDelete);

