nicolas-codemate/esp32-pixelcast/src/main.cpp
    // If no current notification, check if new ones are queued
    if (!notifGetCurrent()) {
        currentNotif = notifGetNext();
        if (currentNotif) {
            // Save current app index to restore later (first time only)
            if (savedAppIndex < 0) {
                savedAppIndex = currentAppIndex;
            }
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers (prevents weather ghosting)
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If a notification is active, skip app rotation
    if (notifGetCurrent()) {
        return;
    }

    // Just finished all notifications: restore app rotation
    if (savedAppIndex >= 0) {
        currentAppIndex = savedAppIndex;
        savedAppIndex = -1;
        lastAppSwitch = now;
        resetScrollState();
        // Reset weather clock cache to force full redraw (not just seconds update)
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        // Reset tracker cache too, otherwise the restored tracker screen stays blank
        trackerLastUpdateDrawn = 0;
        Serial.println("[NOTIF] All dismissed, resuming app rotation");
        // Clear both DMA buffers to remove any notification pixel remnants,
        // then force immediate app redraw on both buffers
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        AppItem* restored = appGetCurrent();
        if (restored) {
            displayShowApp(restored);
            displayShowApp(restored);
            lastDisplayUpdate = now;
        }
    }

    // ---- Normal app rotation ----
    if (appCount == 0) return;

    AppItem* current = appGetCurrent();

    if (current == nullptr) {
        // No current app, get first one
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            // Force immediate redraw
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
        return;
    }

    // Check if current app duration has elapsed
    if (appRotationEnabled && (now - lastAppSwitch > current->duration)) {
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            Serial.printf("[APPS] Switched to: %s\n", current->id);
            // Force immediate redraw on app switch
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
    }
}

// ============================================================================
// Sleep Mode
// ============================================================================

static bool sleepSlotMatches(const SleepSlot& slot, uint8_t hour, uint8_t minute) {
    uint16_t nowMinutes = (uint16_t)hour * 60 + minute;
    uint16_t startMinutes = (uint16_t)slot.startHour * 60 + slot.startMinute;
    uint16_t endMinutes = (uint16_t)slot.endHour * 60 + slot.endMinute;

    if (startMinutes == endMinutes) {
        return false;
    }
    if (endMinutes > startMinutes) {
        return nowMinutes >= startMinutes && nowMinutes < endMinutes;
    }
    return nowMinutes >= startMinutes || nowMinutes < endMinutes;
}

static bool sleepScheduleSaysActive(uint8_t wday, uint8_t hour, uint8_t minute) {
    const SleepDay& day = settings.sleep.days[wday];
    if (day.allDay) return true;

    for (uint8_t slotIndex = 0; slotIndex < day.slotCount; slotIndex++) {
        if (sleepSlotMatches(day.slots[slotIndex], hour, minute)) {
            return true;
        }
    }
    return false;
}

// SLEEP_REASON_NTP_NOT_SYNCED wins over `enabled` so the diagnostic
// stays accurate when the clock is unreliable. sleepUntilEpoch is a
// standard UTC epoch.
bool sleepIsActive() {
    time_t nowUtc = time(nullptr);

    if (nowUtc < NTP_VALID_EPOCH_THRESHOLD) {
        lastSleepReason = SLEEP_REASON_NTP_NOT_SYNCED;
        return false;
    }

    if (!settings.sleep.enabled) {
        lastSleepReason = SLEEP_REASON_NONE;
        return false;
    }

    if ((uint32_t)nowUtc < settings.sleep.sleepUntilEpoch) {
        lastSleepReason = SLEEP_REASON_OVERRIDE;
        return true;
    }

    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    uint8_t wday   = (uint8_t)localTm.tm_wday;
    uint8_t hour   = (uint8_t)localTm.tm_hour;
    uint8_t minute = (uint8_t)localTm.tm_min;

    if (sleepScheduleSaysActive(wday, hour, minute)) {
        lastSleepReason = SLEEP_REASON_SCHEDULE;
        return true;
    }

    lastSleepReason = SLEEP_REASON_NONE;
    return false;
}

// ============================================================================
// Display Loop
// ============================================================================

void loopSleepTransition()
{
    static bool wasSleeping = false;
    static uint8_t previousBrightness = DEFAULT_BRIGHTNESS;
    bool isSleeping = sleepIsActive();

    if (isSleeping && !wasSleeping) {
        Serial.printf("[SLEEP] entering at %u\n", (unsigned)time(nullptr));
        previousBrightness = currentBrightness;
        if (strcmp(settings.sleep.displayMode, "black") == 0) {
            displaySetBrightness(0);
            displayClear();
        } else if (strcmp(settings.sleep.displayMode, "clock") == 0) {
            // Render twice to flush both DMA buffers so the clock replaces
            // any leftover app/notification frame immediately on entry.
            displayShowTime();
            displayShowTime();
            lastDisplayUpdate = millis();
        }
    } else if (!isSleeping && wasSleeping) {
        Serial.printf("[SLEEP] exiting at %u\n", (unsigned)time(nullptr));
        displaySetBrightness(previousBrightness);
        lastDisplayUpdate = 0;
        // The sleep clock overwrote the app frame, so a tracker screen has to repaint
        trackerLastUpdateDrawn = 0;
    }
    wasSleeping = isSleeping;
}

static const char* const CANONICAL_DAY_NAMES[7] = {
    "sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday"
};

